Revit 2024 API
DockablePanes.BuiltInDockablePanes Class
 A collection of ids of the dockable panes provided by Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static class BuiltInDockablePanes
Visual Basic
Public NotInheritable Class BuiltInDockablePanes
Visual C++
public ref class BuiltInDockablePanes abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DockablePanes.BuiltInDockablePanes
See Also
DockablePanes.BuiltInDockablePanes Members
Autodesk.Revit.UI Namespace